# NoMoreExternalDataTypeInstances Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DirectContext3DFailures..::..NoMoreExternalDataTypeInstances Property
BuiltInFailures..::..DirectContext3DFailures Class See Also
---
No more instances of the Coordination Model.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId NoMoreExternalDataTypeInstances { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property NoMoreExternalDataTypeInstances As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ NoMoreExternalDataTypeInstances {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DirectContext3DFailures Class
Autodesk.Revit.DB Namespace